aman-iot-fw/ble_cus_dm_autocon/data_stream_LP_EM_CC2340R5_freertos_ticlang/data_stream.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "CC2340R5RKP" --package "RKP" --part "Default" --rtos "freertos" --product "simplelink_lowpower_f3_sdk@8.10.01.02"
 * @versions {"tool":"1.20.0+3587"}
 */

/**
 * Import the modules used in this configuration.
 */
const FreeRTOS    = scripting.addModule("/freertos/FreeRTOS");
const ble         = scripting.addModule("/ti/ble5stack/ble");
const CCFG        = scripting.addModule("/ti/devices/CCFG");
const rfdesign    = scripting.addModule("/ti/devices/radioconfig/rfdesign");
const Display     = scripting.addModule("/ti/display/Display");
const Display1    = Display.addInstance();
const AESCCM      = scripting.addModule("/ti/drivers/AESCCM");
const AESCCM1     = AESCCM.addInstance();
const AESCTRDRBG  = scripting.addModule("/ti/drivers/AESCTRDRBG");
const AESCTRDRBG1 = AESCTRDRBG.addInstance();
const AESECB      = scripting.addModule("/ti/drivers/AESECB");
const AESECB1     = AESECB.addInstance();
const ECDH        = scripting.addModule("/ti/drivers/ECDH");
const ECDH1       = ECDH.addInstance();
const GPIO        = scripting.addModule("/ti/drivers/GPIO");
const GPIO3       = GPIO.addInstance();
const GPIO4       = GPIO.addInstance();
const GPIO5       = GPIO.addInstance();
const LGPTimer    = scripting.addModule("/ti/drivers/LGPTimer", {}, false);
const LGPTimer1   = LGPTimer.addInstance();
const NVS         = scripting.addModule("/ti/drivers/NVS", {}, false);
const NVS1        = NVS.addInstance();
const NVS2        = NVS.addInstance();
const Power       = scripting.addModule("/ti/drivers/Power");
const RCL         = scripting.addModule("/ti/drivers/RCL");
const RNG         = scripting.addModule("/ti/drivers/RNG");
const RNG1        = RNG.addInstance();
const Settings    = scripting.addModule("/ti/posix/freertos/Settings");

/**
 * Write custom configuration values to the imported modules.
 */
FreeRTOS.heapSize       = 0x00004D50;
FreeRTOS.timerStackSize = 0x00000190;
FreeRTOS.idleStackSize  = 0x00000130;

ble.basicBLE                                          = true;
ble.disDevBySerUuid                                   = true;
ble.numOfAdvSets                                      = 1;
ble.numOfDefAdvSets                                   = 1;
ble.maxNumPrepareWrites                               = 10;
ble.hideHealthToolkit                                 = false;
ble.maxPDUSize                                        = 128;
ble.maxPDUNum                                         = 10;
ble.bondPairing                                       = "GAPBOND_PAIRING_MODE_INITIATE";
ble.addressMode                                       = "ADDRMODE_PUBLIC";
ble.deviceName                                        = "";
ble.defaultTxPowerValue                               = "8";
ble.radioConfig.codeExportConfig.$name                = "ti_devices_radioconfig_code_export_param0";
ble.connUpdateParamsPeripheral.$name                  = "ti_ble5stack_general_ble_conn_update_params0";
ble.advSet1.$name                                     = "ti_ble5stack_broadcaster_advertisement_set0";
ble.advSet1.advParam1.$name                           = "ti_ble5stack_broadcaster_advertisement_params0";
ble.advSet1.advData1.$name                            = "ti_ble5stack_broadcaster_advertisement_data0";
ble.advSet1.advData1.numOfUUIDs16More                 = 1;
ble.advSet1.advData1.UUID016More                      = 0xFFF0;
ble.advSet1.advData1.numOfUUIDs128More                = 1;
ble.advSet1.advData1.GAP_ADTYPE_MANUFACTURER_SPECIFIC = true;
ble.advSet1.advData1.additionalData                   = "0x1111111122222222333333334444444455555555";
ble.advSet1.advData1.companyIdentifier                = 0xADED;
ble.advSet1.advData1.GAP_ADTYPE_FLAGS                 = false;
ble.advSet1.advData1.GAP_ADTYPE_16BIT_MORE            = true;
ble.advSet1.advData1.GAP_ADTYPE_LOCAL_NAME_SHORT      = true;
ble.advSet1.scanRes1.$name                            = "ti_ble5stack_broadcaster_advertisement_data1";
ble.advSet1.scanRes1.GAP_ADTYPE_POWER_LEVEL           = false;
ble.advSet1.scanRes1.GAP_ADTYPE_LOCAL_NAME_COMPLETE   = false;

CCFG.ccfgTemplate.$name = "ti_devices_CCFG_CCFGCC23X0Template0";

Display1.$name                    = "CONFIG_Display_0";
Display1.enableANSI               = true;
Display1.uartBufferSize           = 128;
Display1.uart.$name               = "CONFIG_DISPLAY_UART";
Display1.uart.uart.txPin.$assign  = "DIO20_A11";
Display1.uart.uart.rxPin.$assign  = "DIO12";
Display1.uart.txPinInstance.$name = "CONFIG_PIN_UART_TX";
Display1.uart.rxPinInstance.$name = "CONFIG_PIN_UART_RX";

AESCCM1.$name = "CONFIG_AESCCM0";

AESCTRDRBG1.$name = "CONFIG_AESCTRDRBG_0";

AESECB1.$name = "CONFIG_AESECB0";

ECDH1.$name = "CONFIG_ECDH0";

GPIO3.mode               = "Output";
GPIO3.$name              = "CONFIG_GPIO_OUTPUT_PIN";
GPIO3.outputStrength     = "High";
GPIO3.initialOutputState = "High";
GPIO3.gpioPin.$assign    = "DIO21_A10";

GPIO4.$name           = "CONFIG_GPIO_INPUT_PIN";
GPIO4.pull            = "Pull Up";
GPIO4.gpioPin.$assign = "DIO8";

GPIO5.$name              = "LED_PIN";
GPIO5.mode               = "Output";
GPIO5.outputStrength     = "High";
GPIO5.initialOutputState = "High";
GPIO5.gpioPin.$assign    = "DIO11";

LGPTimer1.$name             = "CONFIG_LGPTIMER_3";
LGPTimer1.interruptPriority = "2";
LGPTimer1.timer.$assign     = "LGPT3";

NVS1.$name                    = "CONFIG_NVS_0";
NVS1.internalFlash.$name      = "ti_drivers_nvs_NVSLPF30";
NVS1.internalFlash.regionBase = 0x7C000;
NVS1.internalFlash.regionSize = 0x4000;

NVS2.$name                    = "CONFIG_NVS_1";
NVS2.internalFlash.$name      = "ti_drivers_nvs_NVSLPF31";
NVS2.internalFlash.regionType = "Pointer";
NVS2.internalFlash.regionBase = 0x32000;
NVS2.internalFlash.regionSize = 0x4A000;

RNG1.$name = "CONFIG_RNG_0";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
Display1.uart.uart.$suggestSolution              = "UART0";
Display1.uart.uart.dmaTxChannel.$suggestSolution = "DMA_CH1";
Display1.uart.uart.dmaRxChannel.$suggestSolution = "DMA_CH0";
